Autodesk.Revit.DB.VertexPair.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.VertexPair.Second
Identifies the second index of VertexPair.
Since:
2012

Autodesk.Revit.DB.VertexPair.First
Identifies the first index of VertexPair.
Since:
2012

Autodesk.Revit.DB.VertexPair.#ctor(System.Int32,System.Int32)
Constructs a new VertexPair from a pair of indices in the curve loops.
Since:
2012

Autodesk.Revit.DB.VertexPair
Indices of a pair of vertices in two CurveLoops(one vertex in each loop).
Remarks:
A vertex is specified by the index in the CurveLoop of the curve having that vertex as its start point. Indexes start at 0.
Since:
2012